Tekla Open API Reference for Tekla Structures 2025
Offset Properties
The Offset type exposes the following members.
Properties
Name | Description
Dx
 The current object's Dx offset. This value is defined using the object's coordinate system.
Dy
 The current object's Dy offset. This value is defined using the current work plane.
Dz
 The current object's Dz offset. This value is defined using the current work plane.
Top
See Also
Reference
Offset Class
Tekla.Structures.Model Namespace